Net(
  (net_u): Prediction(
    (layer_in): Conv2d(3, 64, kernel_size=(9, 9), stride=(1, 1), padding=(4, 4), bias=False)
    (down_conv_0): Conv2d(64, 3, kernel_size=(9, 9), stride=(1, 1), padding=(4, 4), bias=False)
    (up_conv_0): Conv2d(3, 64, kernel_size=(9, 9), stride=(1, 1), padding=(4, 4), bias=False)
    (down_conv_1): Conv2d(64, 3, kernel_size=(9, 9), stride=(1, 1), padding=(4, 4), bias=False)
    (up_conv_1): Conv2d(3, 64, kernel_size=(9, 9), stride=(1, 1), padding=(4, 4), bias=False)
    (down_conv_2): Conv2d(64, 3, kernel_size=(9, 9), stride=(1, 1), padding=(4, 4), bias=False)
    (up_conv_2): Conv2d(3, 64, kernel_size=(9, 9), stride=(1, 1), padding=(4, 4), bias=False)
    (down_conv_3): Conv2d(64, 3, kernel_size=(9, 9), stride=(1, 1), padding=(4, 4), bias=False)
    (up_conv_3): Conv2d(3, 64, kernel_size=(9, 9), stride=(1, 1), padding=(4, 4), bias=False)
  )
  (conv_u): Conv2d(64, 3, kernel_size=(9, 9), stride=(1, 1), padding=(4, 4), bias=False)
  (net_v): Prediction(
    (layer_in): Conv2d(3, 64, kernel_size=(9, 9), stride=(1, 1), padding=(4, 4), bias=False)
    (down_conv_0): Conv2d(64, 3, kernel_size=(9, 9), stride=(1, 1), padding=(4, 4), bias=False)
    (up_conv_0): Conv2d(3, 64, kernel_size=(9, 9), stride=(1, 1), padding=(4, 4), bias=False)
    (down_conv_1): Conv2d(64, 3, kernel_size=(9, 9), stride=(1, 1), padding=(4, 4), bias=False)
    (up_conv_1): Conv2d(3, 64, kernel_size=(9, 9), stride=(1, 1), padding=(4, 4), bias=False)
    (down_conv_2): Conv2d(64, 3, kernel_size=(9, 9), stride=(1, 1), padding=(4, 4), bias=False)
    (up_conv_2): Conv2d(3, 64, kernel_size=(9, 9), stride=(1, 1), padding=(4, 4), bias=False)
    (down_conv_3): Conv2d(64, 3, kernel_size=(9, 9), stride=(1, 1), padding=(4, 4), bias=False)
    (up_conv_3): Conv2d(3, 64, kernel_size=(9, 9), stride=(1, 1), padding=(4, 4), bias=False)
  )
  (conv_v): Conv2d(64, 3, kernel_size=(9, 9), stride=(1, 1), padding=(4, 4), bias=False)
  (net_z): Prediction(
    (layer_in): Conv2d(6, 64, kernel_size=(9, 9), stride=(1, 1), padding=(4, 4), bias=False)
    (down_conv_0): Conv2d(64, 6, kernel_size=(9, 9), stride=(1, 1), padding=(4, 4), bias=False)
    (up_conv_0): Conv2d(6, 64, kernel_size=(9, 9), stride=(1, 1), padding=(4, 4), bias=False)
    (down_conv_1): Conv2d(64, 6, kernel_size=(9, 9), stride=(1, 1), padding=(4, 4), bias=False)
    (up_conv_1): Conv2d(6, 64, kernel_size=(9, 9), stride=(1, 1), padding=(4, 4), bias=False)
    (down_conv_2): Conv2d(64, 6, kernel_size=(9, 9), stride=(1, 1), padding=(4, 4), bias=False)
    (up_conv_2): Conv2d(6, 64, kernel_size=(9, 9), stride=(1, 1), padding=(4, 4), bias=False)
    (down_conv_3): Conv2d(64, 6, kernel_size=(9, 9), stride=(1, 1), padding=(4, 4), bias=False)
    (up_conv_3): Conv2d(6, 64, kernel_size=(9, 9), stride=(1, 1), padding=(4, 4), bias=False)
  )
  (decoder): decoder(
    (conv_1): Conv2d(64, 3, kernel_size=(9, 9), stride=(1, 1), padding=(4, 4), bias=False)
    (conv_2): Conv2d(64, 3, kernel_size=(9, 9), stride=(1, 1), padding=(4, 4), bias=False)
    (conv_3): Conv2d(64, 3, kernel_size=(9, 9), stride=(1, 1), padding=(4, 4), bias=False)
  )
)
