Net(
  (ImageKernel): Kernel_DKN(
    (conv1): Conv2d(1, 32, kernel_size=(7, 7), stride=(1, 1))
    (conv1_bn): BatchNorm2d(32, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
    (conv2): Conv2d(32, 32, kernel_size=(2, 2), stride=(2, 2))
    (conv3): Conv2d(32, 64, kernel_size=(5, 5), stride=(1, 1))
    (conv3_bn): BatchNorm2d(64, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
    (conv4): Conv2d(64, 64, kernel_size=(2, 2), stride=(2, 2))
    (conv5): Conv2d(64, 128, kernel_size=(5, 5), stride=(1, 1))
    (conv5_bn): BatchNorm2d(128, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
    (conv6): Conv2d(128, 128, kernel_size=(3, 3), stride=(1, 1))
    (conv7): Conv2d(128, 128, kernel_size=(3, 3), stride=(1, 1))
    (conv_weight): Conv2d(128, 9, kernel_size=(1, 1), stride=(1, 1))
    (conv_offset): Conv2d(128, 18, kernel_size=(1, 1), stride=(1, 1))
  )
  (DepthKernel): Kernel_DKN(
    (conv1): Conv2d(8, 32, kernel_size=(7, 7), stride=(1, 1))
    (conv1_bn): BatchNorm2d(32, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
    (conv2): Conv2d(32, 32, kernel_size=(2, 2), stride=(2, 2))
    (conv3): Conv2d(32, 64, kernel_size=(5, 5), stride=(1, 1))
    (conv3_bn): BatchNorm2d(64, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
    (conv4): Conv2d(64, 64, kernel_size=(2, 2), stride=(2, 2))
    (conv5): Conv2d(64, 128, kernel_size=(5, 5), stride=(1, 1))
    (conv5_bn): BatchNorm2d(128, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
    (conv6): Conv2d(128, 128, kernel_size=(3, 3), stride=(1, 1))
    (conv7): Conv2d(128, 128, kernel_size=(3, 3), stride=(1, 1))
    (conv_weight): Conv2d(128, 9, kernel_size=(1, 1), stride=(1, 1))
    (conv_offset): Conv2d(128, 18, kernel_size=(1, 1), stride=(1, 1))
  )
)
